yolo_label = {0: '오토바이 탑승자', 
1: '오토바이 탑승자(보행자도로 통행 위반)', 
2: '오토바이 탑승자(안전모 미착용 위반)', 
3: '오토바이 탑승자(무단횡단 위반)', 
4: '오토바이 탑승자(신호 위반)', 
5: '오토바이 탑승자(정지선 위반)', 
6: '오토바이 탑승자(횡단보도 주행 위반)', 
7: '자전거 탑승자', 
8: '자전거 캐리어', 
9: '자전거 탑승자(보행자도로 통행 위반)', 
10: '자전거 탑승자(안전모 미착용 위반)', 
11: '자전거 탑승자(무단횡단 위반)', 
12: '자전거 탑승자(신호 위반)', 
13: '자전거 탑승자(정지선 위반)', 
14: '자전거 탑승자(횡단보도 주행 위반)', 
15: '킥보드 탑승자', 
16: '킥보드 캐리어', 
17: '킥보드 탑승자(보행자도로 통행 위반)', 
18: '킥보드 탑승자(안전모 미착용 위반)', 
19: '킥보드 탑승자(무단횡단 위반)', 
20: '킥보드 탑승자(신호 위반)', 
21: '킥보드 탑승자(횡단보도 주향 위반)', 
22: '킥보드 탑승자(동승자 탑승 위반)'}

yolo_color = {
    0: (255, 0, 0),    # 빨간색
    1: (0, 255, 0),    # 초록색
    2: (0, 0, 255),    # 파란색
    3: (255, 255, 0),  # 노란색
    4: (255, 0, 255),  # 자홍색
    5: (0, 255, 255),  # 청록색
    6: (128, 0, 0),    # 진한 빨간색
    7: (0, 128, 0),    # 진한 초록색
    8: (0, 0, 128),    # 진한 파란색
    9: (128, 128, 0),  # 진한 노란색
    10: (128, 0, 128), # 진한 자홍색
    11: (0, 128, 128), # 진한 청록색
    12: (64, 0, 0),    # 진한 빨간색
    13: (0, 64, 0),    # 진한 초록색
    14: (0, 0, 64),    # 진한 파란색
    15: (64, 64, 0),   # 진한 노란색
    16: (64, 0, 64),   # 진한 자홍색
    17: (0, 64, 64),   # 진한 청록색
    18: (32, 0, 0),    # 진한 빨간색
    19: (0, 32, 0),    # 진한 초록색
    20: (0, 0, 32),    # 진한 파란색
    21: (32, 32, 0),   # 진한 노란색
    22: (32, 0, 32)    # 진한 자홍색
}

color_map = {
    1: (34, 193, 195),     # Red
    2: (201, 63, 32),     # Green
    3: (59, 47, 127),   # Purple
    4: (136, 185, 32),   # Magenta
    5: (222, 194, 197),   # Teal
    6: (71, 61, 40),   # Olive
    7: (207, 73, 210),     # Blue
    8: (137, 121, 131),   # Yellow
    9: (62, 67, 218),     # Maroon
    10: (128, 203, 202),    # Lime
    11: (45, 191, 68),   # Indigo
    12: (206, 207, 85), # Gray
    13: (207, 52, 125) #Black
}